Revit 2026 API

# Transform2D(Transform2D) Constructor

---

The copy constructor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform2D(
	Transform2D other
)
```
```vb
Public Sub New (
	other As Transform2D
)
```
```cpp
public:
Transform2D(
	Transform2D^ other
)
```
```fsharp
new :
        other : Transform2D -> Transform2D
```

#### Parameters

other Transform2D
     The transformation to use as input.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Transform2D Class

Transform2D Overload

Autodesk.Revit.DB Namespace